

#ifndef HYPERLINKFINDER_H
#define HYPERLINKFINDER_H

#include <iostream>
#include <regex>
#include <fstream>
#include <string>
#include <cctype>

// Оголошення функцій

void hyperlink_finder(const std::string& line);
/**
 * @brief Знаходить і виводить гіперпосилання з рядка тексту разом із попереднім словом та роздільниками.
 *
 * Функція використовує регулярний вираз для пошуку гіперпосилань у рядку з ключовими частинами типу "https://",
 * "http://", "ftp." або "www.". Під час пошуку також захоплює слово, яке передує посиланню,
 * та відповідні знаки пунктуації чи пробіли, якщо вони є. Знаки слово, знаки пунктуації або пробіли і
 * власне посилання відповідають окремим індексам змінної 'match'. Результати пошуку виводяться на екран
 * у циклі, ітеруючись по індексам 'match'.
 *
 *
 *
 * @param line Рядок тексту, у якому виконується пошук гіперпосилань.
 */

void printer(std::ifstream& inputFile);
/**
 * @brief Зчитує кожен рядок із файлу та викликає функцію `hyperlink_finder` для пошуку гіперпосилань у рядку.
 *
 * Функція отримує рядок за рядком з файлу `inputFile`, після чого передає його у функцію `hyperlink_finder`
 * для обробки. В результаті виводяться всі знайдені гіперпосилання з кожного рядка.
 *
 * @param inputFile Посилання на об'єкт ifstream для читання файлу.
 */

void file_opener(const std::string& textfile);
/**
 * @brief Відкриває файл і викликає функцію `printer` для обробки вмісту файлу.
 *
 * Функція намагається відкрити вказаний текстовий файл `textfile`. Якщо відкриття успішне, передає файл у функцію
 * `printer`, яка обробляє вміст файлу рядок за рядом. Якщо файл не вдалося відкрити, виводить повідомлення про помилку.
 *
 * @param textfile Ім'я або шлях до текстового файлу для обробки.
 */

#endif // HYPERLINKFINDER_H
